//HELLOEZT JOB (ACCT),'EZT HELLO',CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//COMPGO   EXEC PGM=EZTPA00
//STEPLIB  DD DISP=SHR,DSN=PROD.EZT.EZTPA00.LOAD
//EZTVFM   DD UNIT=SYSDA,SPACE=(4096,(1000,1000))
//EZOPTBL  DD DISP=SHR,DSN=PROD.EZT.OPTIONS
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
DEFINE WDUMMY W 82 A VARYING VALUE ''
JOB INPUT NULL
DISPLAY 'HELLO WORLD'
STOP
/*
